package cn.happy.day01;

public class T1 {
   
	public static void main(String[] args) {
		//定义三个变量 ，i和j没有初值   ，x的值为0
		int  i,j,x=0;
		//进行循环   ，循环 2次     
		for (i=0;i<2;i++){
			//进入循环 x的值+1 ===================看我（我能+1）==================
		     x++;
		     //如下循环的目的是j为奇数的时候 x+1   我们知道 0 1 2 3只有 1 和 3 为奇数  ，所有如下循环
		     //有能力将x的值+2 ==================看我（我能+2）==================
		     for(j=0;j<=3;j++ ){
		           if(j%2 == 0) continue;
		               x++;
		     }
		     
		     //x的值+1       =================看我（我能+1）===================
		    x++;
		} 
		
		System.out.println(x);
		


	}

}
